# INdexing and Slicing the dataframe

In [67]:
import pandas as pd

In [68]:
data = { 
    
    'col1':['a','b','c','d','e','f'],
    'col2': list('pqrstu')


}
data

{'col1': ['a', 'b', 'c', 'd', 'e', 'f'],
 'col2': ['p', 'q', 'r', 's', 't', 'u']}

In [69]:
list('pqrstu')

['p', 'q', 'r', 's', 't', 'u']

In [70]:
df = pd.DataFrame(data, index=[49,48,47,0,1,2])
df

   col1 col2
49    a    p
48    b    q
47    c    r
0     d    s
1     e    t
2     f    u

In [71]:
df =pd.DataFrame(data)
df

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s
4    e    t
5    f    u

In [72]:
l = [1,2,3]
l[0]

1

In [101]:
df.iloc[49]  #label based indexing

SepalLength            5.0
SepalWidth             3.3
PetalLength            1.4
PetalWidth             0.2
Name           Iris-setosa
Name: 49, dtype: object

In [74]:
df.iloc[0] #position based indexing

col1    a
col2    p
Name: 0, dtype: object

In [75]:
df

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s
4    e    t
5    f    u

In [76]:
df.loc[49:0]

Empty DataFrame
Columns: [col1, col2]
Index: []

In [77]:
df.iloc[0:4]

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s

In [78]:
df.iloc[0:4]

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s

# Slicing rows

# Slicing column

In [79]:
df

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s
4    e    t
5    f    u

In [80]:
df[['col1','col2']]

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s
4    e    t
5    f    u

In [81]:
type(df['col1'])

pandas.core.series.Series

In [82]:
df[['col1']]

  col1
0    a
1    b
2    c
3    d
4    e
5    f

In [83]:
type(df)

pandas.core.frame.DataFrame

In [84]:
df['col1']

0    a
1    b
2    c
3    d
4    e
5    f
Name: col1, dtype: object

In [ ]:
df[['col1', 'col2']]

Slicing/selecting the column as DF

In [85]:
df

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s
4    e    t
5    f    u

In [86]:
df.loc [#rows_slicing, column_slicing]

SyntaxError: unexpected EOF while parsing (1934091379.py, line 1)

In [102]:
df.loc[#rows_slicing, column_slicing]

SyntaxError: unexpected EOF while parsing (3470219170.py, line 1)

In [88]:
df.iloc[0:4, 0:2]

  col1 col2
0    a    p
1    b    q
2    c    r
3    d    s

In [89]:
df = pd.read_csv('D:\Sandhya\Data-Science\csv\iris.csv')
df

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

In [90]:
df.iloc[0:4, 1:3]

   SepalWidth  PetalLength
0         3.5          1.4
1         3.0          1.4
2         3.2          1.3
3         3.1          1.5

In [91]:
df.loc[0:3, 'SepalLength':'SepalWidth']

   SepalLength  SepalWidth
0          5.1         3.5
1          4.9         3.0
2          4.7         3.2
3          4.6         3.1

In [92]:
df.loc[0:3, 'Name':'SepalLength']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [93]:
df

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

In [94]:
df.iloc[1,2]

1.4

In [95]:
df.iloc[1:3]

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa

In [96]:
df.iloc[[1,2]]

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa

In [97]:
df.iloc[[1,2], [1,2]]

   SepalWidth  PetalLength
1         3.0          1.4
2         3.2          1.3

# Grouping data

In [105]:
weather_df = pd.read_excel('D:\Sandhya\Data-Science\csv\weather_data.xlsx')
weather_df.head()

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [106]:
df = pd.read_csv('D:\Sandhya\Data-Science\csv\loan_data_set.csv')
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [107]:
df = pd.read_csv('D:\Sandhya\Data-Science\csv\loan_data_set.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [109]:
df.shape

(614, 13)

In [111]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [112]:
df.Gender.unique()

array(['Male', 'Female', nan], dtype=object)

In [113]:
df.Gender.value_counts()

Male      489
Female    112
Name: Gender, dtype: int64

In [110]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [117]:
df.groupby(by='Gender')['ApplicantIncome'].mean()

Gender
Female    4643.473214
Male      5446.460123
Name: ApplicantIncome, dtype: float64

In [118]:
df.groupby(by='Married')['ApplicantIncome'].mean()

Married
No     4970.384977
Yes    5629.173367
Name: ApplicantIncome, dtype: float64

In [122]:
df.groupby(by='Married')['ApplicantIncome','CoapplicantIncome','LoanAmount'].mean()

C:\Users\Yuvaraj\AppData\Local\Temp\ipykernel_2244\986893969.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(by='Married')['ApplicantIncome','CoapplicantIncome','LoanAmount'].mean()

         ApplicantIncome  CoapplicantIncome  LoanAmount
Married
No           4970.384977        1316.558685  128.883495
Yes          5629.173367        1794.632965  155.750000

In [128]:
df.groupby(by=['Married','Gender'])['ApplicantIncome','CoapplicantIncome','LoanAmount'].max()

C:\Users\Yuvaraj\AppData\Local\Temp\ipykernel_2244\1453010767.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(by=['Married','Gender'])['ApplicantIncome','CoapplicantIncome','LoanAmount'].max()

                ApplicantIncome  CoapplicantIncome  LoanAmount
Married Gender
No      Female            18165            41667.0       350.0
        Male              37719            33837.0       650.0
Yes     Female            19484             4486.0       600.0
        Male              81000            20000.0       600.0

In [131]:
df.Married.value_counts()

Yes    398
No     213
Name: Married, dtype: int64

In [133]:
df.groupby(by=['Married','Gender','Education'])['ApplicantIncome','CoapplicantIncome','LoanAmount'].max()

C:\Users\Yuvaraj\AppData\Local\Temp\ipykernel_2244\606539040.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(by=['Married','Gender','Education'])['ApplicantIncome','CoapplicantIncome','LoanAmount'].max()

                             ApplicantIncome  CoapplicantIncome  LoanAmount
Married Gender Education
No      Female Graduate                15759            41667.0       350.0
               Not Graduate            18165             2365.0       225.0
        Male   Graduate                37719            33837.0       650.0
               Not Graduate             7333             2785.0       190.0
Yes     Female Graduate                19484             4486.0       600.0
               Not Graduate             7142             3237.0       178.0
        Male   Graduate                81000            20000.0       600.0
               Not Graduate             7667             7101.0       279.0